-- Запрос 1
select
       оценки."ПРИМЕЧАНИЕ" as оценки_примечание,
       ведомости."ИД" as вкдомости_ид
from
    "Н_ВЕДОМОСТИ" as ведомости
    join
    "Н_ОЦЕНКИ" as оценки
    on ведомости."ОЦЕНКА" = оценки."КОД"
where
    оценки."ПРИМЕЧАНИЕ" = 'неудовлетворительно'
    and
    ведомости."ДАТА" > '2010-06-18'::timestamp
    and
    ведомости."ДАТА" < '1998-01-05'::timestamp;



-- Запрос 2
select
    люди."ИД" as человек_ид,
    обучения."НЗК" as номер_зачетной_книжки,
    ученики."ИД" as человек_ид
from
     "Н_ЛЮДИ" as люди
     right join
     "Н_ОБУЧЕНИЯ" as обучения
     on люди."ИД" = обучения."ЧЛВК_ИД"
     right join
     "Н_УЧЕНИКИ" as ученики
     on люди."ИД" = ученики."ЧЛВК_ИД"
where
    люди."ИМЯ" = 'Николай'
    and
    обучения."ЧЛВК_ИД" < 105590;



-- Запрос 3
with уникальные_отчества as (
    select "ОТЧЕСТВО" as уникальное_отчество
    from "Н_ЛЮДИ"
    group by "ОТЧЕСТВО"
)
select count(*) as количество_уникальных_отчеств from уникальные_отчества;



-- Запрос 4
with группа_ученики as
(
    select группы_2011_КТиУ.номер, count(*) as количество_учеников -- Считаем количество учеников в каждой группе
    from
    "Н_УЧЕНИКИ" as ученики
    join
    (
        select "ГРУППА" as номер -- Выбираем группы на нужных факультетах
        from
        "Н_ГРУППЫ_ПЛАНОВ" as группы_планы
        join
        (
            select планы_2011_года."ИД" -- Выбираем планы 2011 года на нужном факультете
            from "Н_ОТДЕЛЫ" as отделы
            join
            (
                select "ИД", "ОТД_ИД" -- Выбираем планы 2011 года
                from "Н_ПЛАНЫ"
                where "Н_ПЛАНЫ"."УЧЕБНЫЙ_ГОД" = '2011/2012'
            ) as планы_2011_года
            on планы_2011_года."ОТД_ИД" = отделы."ИД"
            where отделы."КОРОТКОЕ_ИМЯ" = 'КТиУ'
        ) as планы_2011_КТиУ
        on группы_планы."ПЛАН_ИД" = планы_2011_КТиУ."ИД"
    ) as группы_2011_КТиУ
    on ученики."ГРУППА" = группы_2011_КТиУ.номер
    group by группы_2011_КТиУ.номер
)
select группа_ученики.номер as номер_группы-- Выбираем группы с 5 учениками
from группа_ученики
where группа_ученики.количество_учеников = 5;


-- Запрос 5

-- 1 вариант

create function get_students_and_avg_marks(group_number int)
returns table (ид int, фамилия varchar(25), имя varchar(15), отчество varchar(20), ср_оценка numeric)
language plpgsql as $$
    begin
        return query
            with человек_оценка as
            (
                select ученики."ИД", ученики."ФАМИЛИЯ", ученики."ИМЯ", ученики."ОТЧЕСТВО", ведомости."ОЦЕНКА"
                from
                "Н_ВЕДОМОСТИ" as ведомости
                join
                (
                    select "ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО"
                    from
                    "Н_ЛЮДИ" as люди
                    join
                    (
                        select ученики."ЧЛВК_ИД"
                        from "Н_УЧЕНИКИ" as ученики
                        where ученики."ГРУППА" = group_number
                    ) as ученики_4100_группы
                    on ученики_4100_группы."ЧЛВК_ИД" = люди."ИД"
                ) as ученики
                on ведомости."ЧЛВК_ИД" = ученики."ИД"
            )
            select "ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО", avg("ОЦЕНКА"::int)
            from человек_оценка
            where
                человек_оценка."ОЦЕНКА" ~ '^[0-9\.]+$'
            group by "ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО";
    end;
$$;


select * from get_students_and_avg_marks(4100);



-- 2 вариант

with человек_оценка as
(
    select ученики."ИД", ученики."ФАМИЛИЯ", ученики."ИМЯ", ученики."ОТЧЕСТВО", ведомости."ОЦЕНКА"
    from
    "Н_ВЕДОМОСТИ" as ведомости
    join
    (
        select "ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО"
        from
        "Н_ЛЮДИ" as люди
        join
        (
            select ученики."ЧЛВК_ИД"
            from "Н_УЧЕНИКИ" as ученики
            where ученики."ГРУППА" = '4100'
        ) as ученики_4100_группы
        on ученики_4100_группы."ЧЛВК_ИД" = люди."ИД"
    ) as ученики
    on ведомости."ЧЛВК_ИД" = ученики."ИД"
)
select "ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО", avg("ОЦЕНКА"::int)
from человек_оценка
where
    человек_оценка."ОЦЕНКА" ~ '^[0-9\.]+$'
    and человек_оценка."ОЦЕНКА"::numeric <=
        (
            with оценки as
            (
                select ведомости."ОЦЕНКА"
                from
                "Н_ВЕДОМОСТИ" as ведомости
                join
                (
                    select "ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО"
                    from
                    "Н_ЛЮДИ" as люди
                    join
                    (
                        select ученики."ЧЛВК_ИД"
                        from "Н_УЧЕНИКИ" as ученики
                        where ученики."ГРУППА" = '1100'
                    ) as ученики_4100_группы
                    on ученики_4100_группы."ЧЛВК_ИД" = люди."ИД"
                ) as ученики
                on ведомости."ЧЛВК_ИД" = ученики."ИД"
            )
            select avg("ОЦЕНКА"::int)
            from оценки
            where
                оценки."ОЦЕНКА" ~ '^[0-9\.]+$'
        )

group by "ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО";




-- 6 запрос
select
    ученики."ИД" as ид_студента,
    люди."ФАМИЛИЯ" as фимилия,
    люди."ИМЯ" as имя,
    люди."ОТЧЕСТВО" as отчество,
    ученики."ГРУППА" as номер_группы,
    ученики."СОСТОЯНИЕ" as состояние_приказа,
    планы."ДАТА_УТВЕРЖДЕНИЯ" as дата_утверждения
from
"Н_УЧЕНИКИ" as ученики
join "Н_ПЛАНЫ" as планы
on ученики."ПЛАН_ИД" = планы."ИД"
join "Н_ФОРМЫ_ОБУЧЕНИЯ" as формы_обучения
on планы."ФО_ИД" = формы_обучения."ИД"
join "Н_НАПР_СПЕЦ" as специальности
on планы."НАПС_ИД" = специальности."ИД"
join "Н_ЛЮДИ" as люди
on ученики."ЧЛВК_ИД" = люди."ИД"
where
    ученики."НАЧАЛО" < '2012-9-1'::timestamp
    and
    планы."КУРС" = 1
    and
    формы_обучения."НАИМЕНОВАНИЕ" = 'Очная'
    and
    специальности."КОД_НАПРСПЕЦ" = '230101';





-- 7 Запрос
with человек_оценка as
    (
         select ученики."ИД", ученики."ФАМИЛИЯ", ученики."ИМЯ", ученики."ОТЧЕСТВО", ведомости."ОЦЕНКА"
         from
         "Н_ВЕДОМОСТИ" as ведомости
         join
         (
             select "ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО"
             from
             "Н_ЛЮДИ" as люди
             join
             (
                 select ученики."ЧЛВК_ИД"
                 from "Н_УЧЕНИКИ" as ученики
                 where ученики."ГРУППА" = '4100'
             ) as ученики_4100_группы
             on ученики_4100_группы."ЧЛВК_ИД" = люди."ИД"
         ) as ученики
         on ведомости."ЧЛВК_ИД" = ученики."ИД"
    )
select "ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО", avg("ОЦЕНКА"::int)
from человек_оценка
where
        человек_оценка."ОЦЕНКА" ~ '^[0-9\.]+$'
        and
        человек_оценка."ОЦЕНКА"::numeric >= 2.5
        and
        человек_оценка."ОЦЕНКА"::numeric < 3.5
group by "ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО";

